#### Terraform Plan: ✅
<details>
<summary>Show</summary>
```terraform
[command]/home/runner/work/_temp/127c8fdd-f944-4e3c-a4cd-cc6974e52416/terraform-bin plan -input=false
random_integer.cf_origin_id: Refreshing state... [id=66]
random_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-wondrous-foxhound]
data.aws_alb.main: Reading...
aws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-wondrous-foxhound]
aws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]
data.aws_security_group.web: Reading...
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster]
module.network.data.aws_security_group.app: Reading...
module.network.data.aws_security_group.web: Reading...
data.aws_caller_identity.current: Reading...
module.network.data.aws_vpc.main: Reading...
aws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E1AOE9DDMZZ8C]
data.aws_caller_identity.current: Read complete after 0s [id=813318847992]
aws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]
data.aws_iam_policy_document.ecs_task_execution_role: Reading...
data.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=320642683]
module.network.data.aws_security_group.data: Reading...
data.aws_security_group.web: Read complete after 0s [id=sg-077ca2fe1ed399078]
module.network.data.aws_security_group.web: Read complete after 0s [id=sg-077ca2fe1ed399078]
aws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]
module.network.data.aws_security_group.data: Read complete after 0s [id=sg-068812412c1f4bea9]
module.network.data.aws_security_group.app: Read complete after 0s [id=sg-03895fdd9a15adf6e]
aws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]
aws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]
data.aws_alb.main: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:loadbalancer/app/default/1551ae1e56885489]
data.aws_alb_listener.front_end: Reading...
aws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20230617125741999900000002]
aws_budgets_budget.cost: Refreshing state... [id=813318847992:startup-sample-monthly]
data.aws_alb_listener.front_end: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener/app/default/1551ae1e56885489/f5e936709b9478dd]
module.network.data.aws_vpc.main: Read complete after 0s [id=vpc-018906cab60cf165b]
module.network.data.aws_subnets.web: Reading...
module.network.data.aws_subnets.app: Reading...
module.network.data.aws_subnets.data: Reading...
aws_security_group.ecs_tasks: Refreshing state... [id=sg-03923973448ca7d58]
aws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/fe91f162f0c5b7fa]
module.network.data.aws_subnets.web: Read complete after 1s [id=ca-central-1]
module.network.data.aws_subnets.app: Read complete after 1s [id=ca-central-1]
module.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Reading...
module.network.data.aws_subnet.web["subnet-089c577af80110363"]: Reading...
module.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Reading...
module.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Reading...
module.network.data.aws_subnets.data: Read complete after 1s [id=ca-central-1]
module.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Reading...
module.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Reading...
aws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]
aws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]
module.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Read complete after 0s [id=subnet-048e25be105ae01d3]
module.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Read complete after 0s [id=subnet-0077fd92d83bfff33]
module.network.data.aws_subnet.web["subnet-089c577af80110363"]: Read complete after 0s [id=subnet-089c577af80110363]
module.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Read complete after 0s [id=subnet-0896ff158c3ecdc53]
module.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Read complete after 0s [id=subnet-0a663db91e3d61619]
aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service]
aws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener-rule/app/default/1551ae1e56885489/f5e936709b9478dd/58393ebe6a46bb37]
module.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Read complete after 0s [id=subnet-0d0e52f2aabe9cd5d]
aws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]
aws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]
aws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]
aws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]
aws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_budgets_budget.cost will be updated in-place
  ~ resource "aws_budgets_budget" "cost" {
        id                = "813318847992:startup-sample-monthly"
        name              = "startup-sample-monthly"
      ~ time_period_start = "2023-06-01_12:00" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
      ~ desired_count                      = 1 -> 2
        id                                 = "arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service"
        name                               = "sample-service"
        tags                               = {
            "Application" = "Startup Sample"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:160" -> (known after apply)
        # (13 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.app[0] must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:160" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "841439284436.dkr.ecr.ca-central-1.amazonaws.com/ssp:2cebf3c048fe9755d9c8984f87b59d16b0193334" -> "841439284436.dkr.ecr.ca-central-1.amazonaws.com/ssp:"
                    name             = "sample-client-app"
                    # (8 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "sample-app-task" -> (known after apply)
      ~ revision                 = 160 -> (known after apply)
        tags                     = {
            "Application" = "Startup Sample"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_budgets_budget.cost,
  on budget.tf line 19, in resource "aws_budgets_budget" "cost":
  19:   cost_filters = {
  20:     TagKeyValue = "user:Project$Startup Sample"
  21:   }

Use the attribute "cost_filter" instead.

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: random_integer.cf_origin_id: Refreshing state... [id=66]%0Arandom_pet.upload_bucket_name: Refreshing state... [id=upload-bucket-wondrous-foxhound]%0Adata.aws_alb.main: Reading...%0Aaws_s3_bucket.upload_bucket: Refreshing state... [id=upload-bucket-wondrous-foxhound]%0Aaws_dynamodb_table.startup_sample_table: Refreshing state... [id=ssp-greetings]%0Adata.aws_security_group.web: Reading...%0Aaws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:cluster/sample-cluster]%0Amodule.network.data.aws_security_group.app: Reading...%0Amodule.network.data.aws_security_group.web: Reading...%0Adata.aws_caller_identity.current: Reading...%0Amodule.network.data.aws_vpc.main: Reading...%0Aaws_cloudfront_distribution.geofencing[0]: Refreshing state... [id=E1AOE9DDMZZ8C]%0Adata.aws_caller_identity.current: Read complete after 0s [id=813318847992]%0Aaws_iam_role.sample_app_container_role: Refreshing state... [id=sample_app_container_role]%0Adata.aws_iam_policy_document.ecs_task_execution_role: Reading...%0Adata.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=320642683]%0Amodule.network.data.aws_security_group.data: Reading...%0Adata.aws_security_group.web: Read complete after 0s [id=sg-077ca2fe1ed399078]%0Amodule.network.data.aws_security_group.web: Read complete after 0s [id=sg-077ca2fe1ed399078]%0Aaws_sns_topic.billing_alert_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:813318847992:startup-sample-billing-alert-topic]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole]%0Amodule.network.data.aws_security_group.data: Read complete after 0s [id=sg-068812412c1f4bea9]%0Amodule.network.data.aws_security_group.app: Read complete after 0s [id=sg-03895fdd9a15adf6e]%0Aaws_iam_role_policy.sample_app_container_cwlogs: Refreshing state... [id=sample_app_container_role:sample_app_container_cwlogs]%0Aaws_iam_role_policy.sample_app_dynamodb: Refreshing state... [id=sample_app_container_role:sample_app_dynamodb]%0Adata.aws_alb.main: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:loadbalancer/app/default/1551ae1e56885489]%0Adata.aws_alb_listener.front_end: Reading...%0Aaws_iam_role_policy.ecs_task_execution_cwlogs: Refreshing state... [id=startupSampleEcsTaskExecutionRole:ecs_task_execution_cwlogs]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=startupSampleEcsTaskExecutionRole-20230617125741999900000002]%0Aaws_budgets_budget.cost: Refreshing state... [id=813318847992:startup-sample-monthly]%0Adata.aws_alb_listener.front_end: Read complete after 0s [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener/app/default/1551ae1e56885489/f5e936709b9478dd]%0Amodule.network.data.aws_vpc.main: Read complete after 0s [id=vpc-018906cab60cf165b]%0Amodule.network.data.aws_subnets.web: Reading...%0Amodule.network.data.aws_subnets.app: Reading...%0Amodule.network.data.aws_subnets.data: Reading...%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-03923973448ca7d58]%0Aaws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:targetgroup/sample-target-group/fe91f162f0c5b7fa]%0Amodule.network.data.aws_subnets.web: Read complete after 1s [id=ca-central-1]%0Amodule.network.data.aws_subnets.app: Read complete after 1s [id=ca-central-1]%0Amodule.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Reading...%0Amodule.network.data.aws_subnet.web["subnet-089c577af80110363"]: Reading...%0Amodule.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Reading...%0Amodule.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Reading...%0Amodule.network.data.aws_subnets.data: Read complete after 1s [id=ca-central-1]%0Amodule.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Reading...%0Amodule.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Reading...%0Aaws_iam_role_policy.ssp_bucket_policy: Refreshing state... [id=sample_app_container_role:upload_bucket_policy]%0Aaws_ecs_task_definition.app[0]: Refreshing state... [id=sample-app-task]%0Amodule.network.data.aws_subnet.app["subnet-048e25be105ae01d3"]: Read complete after 0s [id=subnet-048e25be105ae01d3]%0Amodule.network.data.aws_subnet.web["subnet-0077fd92d83bfff33"]: Read complete after 0s [id=subnet-0077fd92d83bfff33]%0Amodule.network.data.aws_subnet.web["subnet-089c577af80110363"]: Read complete after 0s [id=subnet-089c577af80110363]%0Amodule.network.data.aws_subnet.app["subnet-0896ff158c3ecdc53"]: Read complete after 0s [id=subnet-0896ff158c3ecdc53]%0Amodule.network.data.aws_subnet.data["subnet-0a663db91e3d61619"]: Read complete after 0s [id=subnet-0a663db91e3d61619]%0Aaws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service]%0Aaws_lb_listener_rule.host_based_weighted_routing: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:813318847992:listener-rule/app/default/1551ae1e56885489/f5e936709b9478dd/58393ebe6a46bb37]%0Amodule.network.data.aws_subnet.data["subnet-0d0e52f2aabe9cd5d"]: Read complete after 0s [id=subnet-0d0e52f2aabe9cd5d]%0Aaws_appautoscaling_target.target[0]: Refreshing state... [id=service/sample-cluster/sample-service]%0Aaws_appautoscaling_policy.up[0]: Refreshing state... [id=sample_scale_up]%0Aaws_appautoscaling_policy.down[0]: Refreshing state... [id=sample_scale_down]%0Aaws_cloudwatch_metric_alarm.service_cpu_high[0]: Refreshing state... [id=sample_cpu_utilization_high]%0Aaws_cloudwatch_metric_alarm.service_cpu_low[0]: Refreshing state... [id=sample_cpu_utilization_low]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_budgets_budget.cost will be updated in-place%0A  ~ resource "aws_budgets_budget" "cost" {%0A        id                = "813318847992:startup-sample-monthly"%0A        name              = "startup-sample-monthly"%0A      ~ time_period_start = "2023-06-01_12:00" -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A%0A%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_service.main[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A      ~ desired_count                      = 1 -> 2%0A        id                                 = "arn:aws:ecs:ca-central-1:813318847992:service/sample-cluster/sample-service"%0A        name                               = "sample-service"%0A        tags                               = {%0A            "Application" = "Startup Sample"%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:160" -> (known after apply)%0A        # (13 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecs_task_definition.app[0] must be replaced%0A-/+ resource "aws_ecs_task_definition" "app" {%0A      ~ arn                      = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task:160" -> (known after apply)%0A      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:813318847992:task-definition/sample-app-task" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [ # forces replacement%0A              ~ {%0A                  ~ image            = "841439284436.dkr.ecr.ca-central-1.amazonaws.com/ssp:2cebf3c048fe9755d9c8984f87b59d16b0193334" -> "841439284436.dkr.ecr.ca-central-1.amazonaws.com/ssp:"%0A                    name             = "sample-client-app"%0A                    # (8 unchanged elements hidden)%0A                } # forces replacement,%0A            ]%0A        )%0A      ~ id                       = "sample-app-task" -> (known after apply)%0A      ~ revision                 = 160 -> (known after apply)%0A        tags                     = {%0A            "Application" = "Startup Sample"%0A        }%0A        # (9 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 2 to change, 1 to destroy.%0A%0AWarning: Argument is deprecated%0A%0A  with aws_budgets_budget.cost,%0A  on budget.tf line 19, in resource "aws_budgets_budget" "cost":%0A  19:   cost_filters = {%0A  20:     TagKeyValue = "user:Project$Startup Sample"%0A  21:   }%0A%0AUse the attribute "cost_filter" instead.%0A%0A(and 7 more similar warnings elsewhere)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

```
</details>
#### Architecture Diagram

![img]()
*Pusher:* @prabhukiran9999, *Action:* [Pull Request: #7](https://github.com/prabhukiran9999/startup-sample-project-aws-containers/actions/runs/5298859349)